tap "go-task/tap"
tap "hashicorp/tap"
tap "xwmx/taps"

brew "bat"
brew "glib"
brew "falco"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "harfbuzz"
brew "htop"
brew "jq"
brew "lefthook"
brew "lychee"
brew "neovim"
brew "pinact"
brew "pyenv"
brew "python@3.12"
brew "rustup"
brew "starship"
brew "telnet"
brew "tree"
brew "wget"
brew "zsh-completions"
brew "grafana/grafana/alloy", trusted: true
brew "go-task/tap/go-task", trusted: true
brew "hashicorp/tap/terraform", trusted: true
brew "xwmx/taps/nb", trusted: true

cask "wezterm"
cask "visual-studio-code"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "postman"

vscode "aflo.kanagawa-glass"
vscode "anthropic.claude-code"
vscode "denoland.vscode-deno"
vscode "fastly.vscode-fastly-vcl"
vscode "golang.go"
vscode "Grafana.grafana-alloy"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "oxc.oxc-vscode"
vscode "ms-python.vscode-pylance"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "ms-python.vscode-python-envs"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "voidzero.vite-plus-extension-pack"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "hashicorp.terraform"

go "golang.org/x/tools/gopls"

cargo "cargo-binstall"
cargo "cargo-insta"
cargo "cargo-watch"
cargo "wasm-bindgen-cli"
cargo "wasm-opt"
cargo "wasm-pack"
cargo "wasm-tools"

npm "pnpm"
